<?php

use App\Contracts\Entities\InfoContract;
use App\Info;
use Illuminate\Database\Seeder;

class ParkSeeder extends Seeder
{
    protected $json = '[
  {
    "name_kz": "Мәдениет және демалыс саябағы",
    "contact_telefon": "87018156465",
    "address": "г.Атырау, мкр.Жилгородок",
    "geoposition": "47,09938373797171,                     51,89621217548847",
    "rukovoditelya_kz": "\"Трава у дома\" ЖШС-і-директор: Тегай Татьяна Родионовна\n\n",
    "schedule_kz": "Дс-Жс: 09:00-00:00",
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "address_kz": "Атырау қаласы, Тұрғындар қалашығы ықшам ауданы",
    "rukovoditelya": "ТОО \"Трава у дома\" директор:  Тегай Татьяна Родионовна",
    "name": "Парк культуры и отдыха",
    "schedule": "Пн-Вс: 09:00-00:00",
    "email": "Tahya.tegay@gmail.com",
    "id": "1",
    "vidy_uslug": "Организация культурного досуга населения"
  },
  {
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "name_kz": "«Жеңіс» саябағы",
    "address": "г.Атырау,                                     4-мкр. Авангард ",
    "address_kz": "Атырау қаласы,\nАвангард - 4 ықшам ауданы\n",
    "geoposition": "47,0933215483716,                  51,88726432621479",
    "name": "Парк \"Победа\"",
    "schedule": "Пн-Вс: 09:00-00:00",
    "id": "2",
    "schedule_kz": "Дс-Жс: 09:00-00:00",
    "vidy_uslug": "Организация культурного досуга населения"
  },
  {
    "name_kz": "Тәуелсіздік саябағы",
    "contact_telefon": " 8/71233/20434",
    "address": "Атырауская область, с.Курмангазы,  ул.Б.Ахметкалиева, 17",
    "geoposition": "46.60262197777216,  49.271950006468614",
    "rukovoditelya_kz": "Мұғалім Мұрабек Рифхатұлы.  \n\n",
    "schedule_kz": "Тәулік бойы",
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "address_kz": "Атырау облысы, Құрманғазы ауылы, Б.Ахметқалиев көшесі, 17",
    "rukovoditelya": "Мұғалім Мұрабек Рифхатұлы",
    "name": "Парк Независимости",
    "schedule": "В течении дня",
    "email": "ganyushkino.akimat@mail.ru",
    "id": "3",
    "vidy_uslug": "Организация культурного досуга населения"
  },
  {
    "name_kz": "«Даңқ» саябағы",
    "contact_telefon": "8/71238/2-18-58",
    "address": "Атырауская область, Кызылкогинский район, с.Миялы,\nул.А.Кунанбаев, №6 а\n",
    "geoposition": "48.887727172325455,  53.790944248394226",
    "rukovoditelya_kz": "Базарбаев Қайырғали Ермекбайұлы",
    "schedule_kz": "Тәулік бойы",
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "address_kz": "Атырау облысы,  Қызылқоға ауданы, Миялы ауылы,\nА.Құнанбаев көшесі,  №6 а\n",
    "rukovoditelya": "Базарбаев Қайырғали Ермекбайұлы",
    "name": "Парк \"Даңқ\"",
    "schedule": "В течении дня",
    "email": "mialy_okryg@mail.ru",
    "id": "4",
    "vidy_uslug": "Организация культурного досуга населения"
  },
  {
    "name_kz": "А.Сарбөпеев атындағы саябақ",
    "contact_telefon": "8/71238/2-13-85",
    "address": "Атырауская область, Кызылкогинский район, с.Миялы, ул.Х.Досмухамедулы,\n№12\n",
    "geoposition": "48.887335640333525, 53.786947756962036",
    "rukovoditelya_kz": "Базарбаев Қайырғали Ермекбайұлы",
    "schedule_kz": "Тәулік бойы",
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "address_kz": "Атырау облысы,  Қызылқоға ауданы, Миялы ауылы, Х.Досмұхамедұлы\nкөшесі, №12\n",
    "rukovoditelya": "Базарбаев Қайырғали Ермекбайұлы",
    "name": "Парк имени А.Сарбопеева ",
    "schedule": "В течении дня",
    "email": "mialy_okryg@mail.ru",
    "id": "5",
    "vidy_uslug": "Организация культурного досуга населения"
  },
  {
    "name_kz": "«Жастар» саябағы",
    "contact_telefon": "8/71238/2-13-85",
    "address": "Атырауская область, Кызылкогинский район, с.Миялы, \nул.А.Кунанбаев,  №2\n",
    "geoposition": "48.8882456833163085,  53.78752711410925",
    "rukovoditelya_kz": "Базарбаев Қайырғали Ермекбайұлы",
    "schedule_kz": "Тәулік бойы",
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "address_kz": "Атырау облысы,  Қызылқоға ауданы, Миялы ауылы,\nА.Құнанбаев көшесі, №2\n",
    "rukovoditelya": "Базарбаев Қайырғали Ермекбайұлы",
    "name": "Парк \"Жастар\"",
    "schedule": "В течении дня",
    "email": "mialy_okryg@mail.ru",
    "id": "6",
    "vidy_uslug": "Организация культурного досуга населения"
  },
  {
    "name_kz": "Демалыс саябағы ",
    "contact_telefon": "8/71236/ 22048",
    "address": "Атырауская область,  Махамбетский район, с.Махамбет, \nул.Туржанов, № 60",
    "geoposition": "47.67351141342494,\n51.57658279873431\n",
    "rukovoditelya_kz": " Мыңбаев Басерат Салықұлы                ",
    "schedule_kz": " Тәулік бойы",
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "address_kz": "Атырау облысы,  Махамбет ауданы, Махамбет ауылы\nТұржанов көшесі, №60\n",
    "rukovoditelya": "Мыңбаев Басерат Салықұлы",
    "name": "Парк отдыха",
    "schedule": "В течении дня",
    "id": "7",
    "vidy_uslug": "Организация культурного досуга населения"
  },
  {
    "name_kz": "Мәдени-қоғамдық демалыс орталығы",
    "contact_telefon": "8 778 630 30 98",
    "address": "Атырау облысы,   Индер   ауданы, Индербор кенті\nТұхфатов көшесі, 70\n",
    "geoposition": "48.56292165069524,  51.7515641755017",
    "rukovoditelya_kz": "Аймуратов Асхат Саламатұлы",
    "schedule_kz": "Дс-Жс: 08:00-00:00",
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "address_kz": "Атырауская область,  Индерский район, п.Индербор,\nул.Тухфатов, 70",
    "rukovoditelya": "Аймуратов Асхат Саламатұлы",
    "name": "Культурно-общественный центр отдыха",
    "schedule": "Пн-Вс: 08:00-00:00",
    "email": "akim_inderbor@mail.ru",
    "id": "8",
    "vidy_uslug": "Организация культурного досуга населения"
  },
  {
    "name_kz": "«Достық» саябағы",
    "contact_telefon": "8/71237/50887, 8/71237/35930",
    "address": "Атырауская область,  Жылыойский район, г.Кульсары, 1мкр, ул.Танкыбаев, 27",
    "geoposition": "46.95779246871191,\n53.98751311004162\n",
    "rukovoditelya_kz": "Ысмағұл Ернар Құтқожаұлы",
    "schedule_kz": " Тәулік бойы",
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "address_kz": "Атырау облысы,   Жылыой  ауданы, Құлсары қаласы,\n1 ықшам ауданы,\nТаңқыбаев көшесі, 27\n",
    "rukovoditelya": "Ысмағұл Ернар Құтқожаұлы",
    "name": "Парк \"Достық\"",
    "schedule": "В течении дня",
    "email": "e.ysmagul@atyrau.gov.kz",
    "id": "9",
    "vidy_uslug": "Организация культурного досуга населения"
  },
  {
    "name_kz": "«Жеңіс» саябағы",
    "contact_telefon": "8/71237/50887, 8/71237/35930",
    "address": "Атырауская область,  Жылыойский район, г.Кульсары,\nпроспект Махамбета, 210\n",
    "geoposition": "46.96141036825921,\n54.00671396586404\n",
    "rukovoditelya_kz": "Ысмағұл Ернар Құтқожаұлы",
    "schedule_kz": " Тәулік бойы",
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "address_kz": "Атырау облысы,   Жылыой  ауданы, Құлсары қаласы,\nМахамбет даңғылы, 210\n",
    "rukovoditelya": "Ысмағұл Ернар Құтқожаұлы",
    "name": "Парк «Жеңіс» ",
    "schedule": "В течении дня",
    "email": "e.ysmagul@atyrau.gov.kz",
    "id": "10",
    "vidy_uslug": "Организация культурного досуга населения"
  },
  {
    "name_kz": "«Жансая» саябағы",
    "contact_telefon": "8/71237/50887, 8/71237/35930",
    "address": "Атырауская область,  Жылыойский район, г.Кульсары,\n5 микрорайон\n",
    "geoposition": "46.951661080659996,\n53.99205006659031\n",
    "rukovoditelya_kz": "Ысмағұл Ернар Құтқожаұлы",
    "schedule_kz": " Тәулік бойы",
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "address_kz": "Атырау облысы,   Жылыой  ауданы, Құлсары қаласы,\n5 ықшам ауданы\n",
    "rukovoditelya": "Ысмағұл Ернар Құтқожаұлы",
    "name": "Парк «Жансая» ",
    "schedule": "В течении дня",
    "email": "e.ysmagul@atyrau.gov.kz",
    "id": "11",
    "vidy_uslug": "Организация культурного досуга населения"
  },
  {
    "name_kz": "«Нұрсая» саябағы",
    "contact_telefon": "8/71237/50887, 8/71237/35930",
    "address": "Атырауская область,  Жылыойский район, г.Кульсары,\nул.И.Тайманова\n",
    "geoposition": "46.96073396358971,\n54.01427645418153\n",
    "rukovoditelya_kz": "Ысмағұл Ернар Құтқожаұлы",
    "schedule_kz": " Тәулік бойы",
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "address_kz": "Атырау облысы,   Жылыой  ауданы, Құлсары қаласы,\nИ.Тайманов көшесі\n",
    "rukovoditelya": "Ысмағұл Ернар Құтқожаұлы",
    "name": "Парк «Нұрсая» ",
    "schedule": "В течении дня",
    "email": "e.ysmagul@atyrau.gov.kz",
    "id": "12",
    "vidy_uslug": "Организация культурного досуга населения"
  },
  {
    "vidy_uslug_kz": "Халықтың мәдени демалысын ұйымдастыру",
    "name_kz": "Боран Қалиев атындағы саябақ",
    "address": "Атырауская область,  Макатский район, п.Доссор, ул.Г.Сулейменова,       № 39.",
    "address_kz": "Атырау облысы,   Мақат  ауданы, Доссор кенті, Ғ.Сүлейменова көшесі, № 39.",
    "geoposition": "47.529701423355405,\n52.97556987963617\n",
    "rukovoditelya": "Кабдикаримова Ризагул Уапқызы ",
    "name": "Парк имени Борана Калиева",
    "schedule": "Пн-Пт: 08:30-18:00",
    "id": "13",
    "rukovoditelya_kz": "Кабдикаримова Ризагул Уапқызы \n",
    "schedule_kz": "Дс-Жм: 08:30-18:00",
    "vidy_uslug": "Организация культурного досуга населения"
  }
]';

/**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = json_decode($this->json);

        foreach ($data as $row) {
            $row    = (array) $row;
            $values = array_only($row, InfoContract::FIELD_LIST);
            $values = array_map('trim', $values);

            Info::create(
                array_merge(
                    $values,
                    [
                        InfoContract::FIELD_TYPE => InfoContract::TYPE_PARK,
                    ]
                )
            );
        }
    }
}
